In [1]:
x=[None,8,None,8,9,None]
t=x[0]
o=[]
for i in x:
    if i is None:
        o.append(t)
    else:
        t=i
        o.append(i)
o

[None, 8, 8, 8, 9, 9]

In [19]:
import pandas as pd
df=pd.read_csv('bank.csv')
df.dtypes

Date      object
Name      object
Amount     int64
dtype: object

In [9]:
pd.to_datetime(df['Date'])

0   2019-01-02
1   2019-01-03
2   2019-01-02
3   2019-02-03
4   2019-02-04
5   2019-02-05
Name: Date, dtype: datetime64[ns]

In [11]:
df.dtypes

Date      object
Name      object
Amount     int64
dtype: object

In [20]:
df['Date_Format'] = df['Date'].astype('datetime64[ns]')

In [21]:
df

       Date     Name  Amount Date_Format
0  1/2/2019  Ranjeet       5  2019-01-02
1  1/3/2019  Ranjeet       4  2019-01-03
2  1/2/2019     Ajay       3  2019-01-02
3  2/3/2019  Ranjeet       6  2019-02-03
4  2/4/2019     Ajay       3  2019-02-04
5  2/5/2019     Ajay       7  2019-02-05

In [22]:
df['month_year'] = pd.to_datetime(df['Date_Format']).dt.to_period('M')

In [23]:
df

       Date     Name  Amount Date_Format month_year
0  1/2/2019  Ranjeet       5  2019-01-02    2019-01
1  1/3/2019  Ranjeet       4  2019-01-03    2019-01
2  1/2/2019     Ajay       3  2019-01-02    2019-01
3  2/3/2019  Ranjeet       6  2019-02-03    2019-02
4  2/4/2019     Ajay       3  2019-02-04    2019-02
5  2/5/2019     Ajay       7  2019-02-05    2019-02

In [24]:
df.groupby(['month_year','Name']).sum()

                    Amount
month_year Name
2019-01    Ajay          3
           Ranjeet       9
2019-02    Ajay         10
           Ranjeet       6